In [ ]:
There are some duplicate rows in the DataFrame based on the email column.

Write a solution to remove these duplicate rows and keep only the first occurrence.

In [ ]:
+-------------+---------+---------------------+
| customer_id | name    | email               |
+-------------+---------+---------------------+
| 1           | Ella    | emily@example.com   |
| 2           | David   | michael@example.com |
| 3           | Zachary | sarah@example.com   |
| 4           | Alice   | john@example.com    |
| 5           | Finn    | john@example.com    |
| 6           | Violet  | alice@example.com   |
+-------------+---------+---------------------+

In [7]:
import pandas as pd

In [11]:
customers=pd.DataFrame({'customer_id':[1,2,3,4,5,6],'name':['Ella','David','Zachary','Alice','Finn','Violet'],'email':['emily@example.com','michael@example.com','sarah@example.com','john@example.com','john@example.com','john@example.com']})

In [12]:
customers

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com
5            6   Violet     john@example.com

In [14]:
customers.drop_duplicates(subset='email',keep='first')

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com